////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Автотест 1
Решение автотеста1:
using System;

//Тело класса будет написано студентом. Класс обязан иметь статический метод PrintResult()
class UserInputToCompileForTest
{
    // Напишите программу, которая на вход принимает позиции элемента в двумерном массиве, и возвращает значение этого элемента или же указание, что такого элемента нет.

    // Поиск элемента по позициям
    public static int FindElementByPosition(int[,] array, int x, int y)
    {
        //Напишите свое решение здесь
        int result = array[x - 1, y - 1];
        return result;
    }

    // Проверка позиций на вхождение в массив
    public static bool ValidatePosition(int[,] array, int x, int y)
    {
        //Напишите свое решение здесь
        if (x > array.GetLength(0))
        {
            return false;
        }
        return true;
    }

    public static void PrintResult(int[,] numbers, int x, int y)
    {
        bool row = ValidatePosition(numbers, x, y);
        bool column = ValidatePosition(numbers, y, x);
        if (row == false)
        {
            Console.WriteLine("Позиция по рядам выходит за пределы массива");
        }
        else if (column == false)
        {
            Console.WriteLine("Позиция по колонкам выходит за пределы массива");
        }
        else
        {
            int result = FindElementByPosition(numbers, x, y);
            Console.WriteLine(result);
        }

    }
}
//Не удаляйте и не меняйте класс Answer!   ------------------------------------------------------------ вот до этой строки часть кода. Все что ниже - не меняется 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////